In [1]:
import pandas as pd

>pandas 를 import 하고 ps 라는 단축어로 사용
---

In [2]:
friend_dict_list = [
    {'name': 'Jone', 'age': 15, 'job': 'student'},
    {'name': 'Jenny', 'age': 30, 'job': 'developer'},
    {'name': 'Nate', 'age': 30, 'job': 'teacher'},
]

In [3]:
df = pd.DataFrame(friend_dict_list, columns = ['name', 'age', 'job'])
df

    name  age        job
0   Jone   15    student
1  Jenny   30  developer
2   Nate   30    teacher

>friend_dict_list DataFrame 생성
---

In [4]:
df['salary'] = 0

In [5]:
df

    name  age        job  salary
0   Jone   15    student       0
1  Jenny   30  developer       0
2   Nate   30    teacher       0

>'salary' column을 생성하고 값으로 0을 넣어 저장
---

In [6]:
import numpy as np

>numpy 를 import 하고 np 라는 단축어로 사용
---

In [7]:
df['salary'] = np.where(df['job'] != 'student', 'yes', 'no')

In [8]:
df

    name  age        job salary
0   Jone   15    student     no
1  Jenny   30  developer    yes
2   Nate   30    teacher    yes

>'job'이 'student'가 아니면 'yes', 'student' 이면 'no' 을 'Salary'에 
---

In [9]:
friend_dict_list = [
    {'name': 'Jone', 'midterm': 95, 'final': 85},
    {'name': 'Jenny', 'midterm': 85, 'final': 80},
    {'name': 'Nate', 'midterm': 30, 'final': 10}
]

In [10]:
df = pd.DataFrame(friend_dict_list, columns = ['name', 'midterm', 'final'])
df

    name  midterm  final
0   Jone       95     85
1  Jenny       85     80
2   Nate       30     10

In [11]:
df['total'] = df['midterm'] + df['final']

In [12]:
df

    name  midterm  final  total
0   Jone       95     85    180
1  Jenny       85     80    165
2   Nate       30     10     40

---

In [13]:
df['average'] = df['total']/2

In [14]:
df

    name  midterm  final  total  average
0   Jone       95     85    180     90.0
1  Jenny       85     80    165     82.5
2   Nate       30     10     40     20.0

---

In [15]:
grades = []

In [16]:
for row in df['average']:
    if row >= 90:
        grades.append('A')
    elif row >= 80:
        grades.append('B')
    else:
        grades.append('F')
df['grade'] = grades

In [17]:
df

    name  midterm  final  total  average grade
0   Jone       95     85    180     90.0     A
1  Jenny       85     80    165     82.5     B
2   Nate       30     10     40     20.0     F

In [18]:
def pass_or_fail(row):
    if row !='F':
        return 'Pass'
    else:
        return 'Fail'

In [19]:
df['P/F'] = df.grade.apply(pass_or_fail)

In [20]:
df

    name  midterm  final  total  average grade   P/F
0   Jone       95     85    180     90.0     A  Pass
1  Jenny       85     80    165     82.5     B  Pass
2   Nate       30     10     40     20.0     F  Fail

In [21]:
date_list = [
    {'yyyy-mm-dd' : '2000-06-27'},
    {'yyyy-mm-dd' : '2007-10-27'},
]

In [22]:
pd.DataFrame(date_list, columns = ['yyyy-mm-dd'])

   yyyy-mm-dd
0  2000-06-27
1  2007-10-27

In [23]:
df  = pd.DataFrame(date_list, columns = ['yyyy-mm-dd'])

In [24]:
def extract_year(row):
    return row.split('-')[0]

In [25]:
df['year'] = df['yyyy-mm-dd'].apply(extract_year)

In [26]:
df

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2007-10-27  2007

In [27]:
friend_dict_list = [
    {'name': 'Jone', 'midterm': 95, 'final': 85},
    {'name': 'Jenny', 'midterm': 85, 'final': 80},
    {'name': 'Nate', 'midterm': 30, 'final': 10}
]

In [28]:
df = pd.DataFrame(friend_dict_list, columns = ['name', 'midterm', 'final'])
df

    name  midterm  final
0   Jone       95     85
1  Jenny       85     80
2   Nate       30     10

In [29]:
df2 = pd.DataFrame([
    ['Ben', 50,50]
], columns = ['name', 'midterm', 'final'])

In [30]:
df2

  name  midterm  final
0  Ben       50     50

In [31]:
df.append(df2, ignore_index = True)

    name  midterm  final
0   Jone       95     85
1  Jenny       85     80
2   Nate       30     10
3    Ben       50     50